In [2]:
import pandas as pd; import numpy as np;

In [5]:
df = pd.DataFrame(np.arange(12).reshape(3,4),
                 index=[0,1,2],
                 columns=["Ali","Ayşe","Kübra","Mehmet"])
df

   Ali  Ayşe  Kübra  Mehmet
0    0     1      2       3
1    4     5      6       7
2    8     9     10      11

In [6]:
s = pd.Series(["bir","iki","uc"])
df.index = df.index.map(s)

In [7]:
df

     Ali  Ayşe  Kübra  Mehmet
bir    0     1      2       3
iki    4     5      6       7
uc     8     9     10      11

In [8]:
df.rename(index = str.title, columns = str.upper)

     ALI  AYŞE  KÜBRA  MEHMET
Bir    0     1      2       3
Iki    4     5      6       7
Uc     8     9     10      11

In [10]:
df

     Ali  Ayşe  Kübra  Mehmet
bir    0     1      2       3
iki    4     5      6       7
uc     8     9     10      11

In [12]:
df.rename(index = {"bir":"on"}, columns = {"Mehmet":"ata"}, inplace=True)

In [13]:
df

     Ali  Ayşe  Kübra  ata
on     0     1      2    3
iki    4     5      6    7
uc     8     9     10   11